IDENTIFICATION DIVISION.
PROGRAM-ID. FORMAT-CURRENCY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 AMOUNT       PIC 9(9).
01 AMOUNT-FMT   PIC Z,ZZZ,ZZ9.

PROCEDURE DIVISION.
    DISPLAY "ENTER AMOUNT: ".
    ACCEPT AMOUNT.

    MOVE AMOUNT TO AMOUNT-FMT.

    DISPLAY "FORMATTED AMOUNT: " FUNCTION TRIM(AMOUNT-FMT).

    STOP RUN.
