IDENTIFICATION DIVISION.
PROGRAM-ID. SORT-ARRAY.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ARR.
   05 NUM PIC 9(3) OCCURS 5 TIMES.
01 I PIC 9.
01 J PIC 9.
01 TEMP PIC 9(3).

PROCEDURE DIVISION.
    DISPLAY "ENTER 5 NUMBERS (MAX 999):".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        ACCEPT NUM(I)
    END-PERFORM.

    *> Bubble sort
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 4
        PERFORM VARYING J FROM I BY 1 UNTIL J > 5
            IF NUM(I) > NUM(J)
                MOVE NUM(I) TO TEMP
                MOVE NUM(J) TO NUM(I)
                MOVE TEMP TO NUM(J)
            END-IF
        END-PERFORM
    END-PERFORM.

    DISPLAY "SORTED ARRAY:".
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
        DISPLAY NUM(I)
    END-PERFORM.

    STOP RUN.
