       05 USER-ID           PIC 9(05).
       05 USER-NAME         PIC X(20).
       05 USER-ROLE         PIC X(10).
       05 USER-BALANCE      PIC 9(07)V99.