IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-NAME-AGE.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(10).
01 WS-AGE  PIC 99.

PROCEDURE DIVISION.
    DISPLAY "ENTER YOUR NAME: ".
    ACCEPT WS-NAME.

    DISPLAY "ENTER YOUR AGE: ".
    ACCEPT WS-AGE.

    DISPLAY "HELLO " FUNCTION TRIM(WS-NAME) ", " WS-AGE " YEARS OLD".

    STOP RUN.
