IDENTIFICATION DIVISION.
PROGRAM-ID. SUM-TWO-NUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(5).
01 NUM2 PIC 9(5).
01 TOTAL PIC 9(6).

PROCEDURE DIVISION.
    DISPLAY "ENTER FIRST NUMBER: ".
    ACCEPT NUM1.

    DISPLAY "ENTER SECOND NUMBER: ".
    ACCEPT NUM2.

    COMPUTE TOTAL = NUM1 + NUM2.

    DISPLAY "SUM = " TOTAL.

    STOP RUN.
